import React, { useEffect, useState } from 'react'

const VMGOView = () => {

    const [render, setrender] = useState(false)
    const vmgoHtml = ''
    useEffect(() => {
        setrender(true)
    },[])

    return (
        <div className='container mx-auto py-10 px-2'>
            <div className='border-l-8 border-primary px-5'>
                <h2 className='text-primary font-bold text-3xl'>Our <span className='text-primaryDark'>VMGO</span></h2>
                <p className='uppercase text-gray-600 text-sm font-medium mt-2'>Vision|Mission|Goals|Objectives</p>
                <p className='uppercase text-gray-600 text-sm font-medium mt-2'>Commitment to Excellence</p>
            </div>
            <p dangerouslySetInnerHTML={{ __html: render && vmgoHtml }} className='mt-10'></p>
            <div>
                <p>स्थानीय श्रोत&nbsp;साधनको दीगो व्यवस्थापन र सामाजिक परिचालनको माध्यमबाट पछाडि परेका-पारिएका वर्ग तथा समुदायको सशक्तीकरण एवं सामाजिक समावेशीकरणमा जोड दिदैं अधिकारमुखी अवधारणाका साथ सामुदायिक विकास तथा सामाजिक रुपान्तरण प्रक्रियामा सहजीकरण गर्दै समृद्ध समाज निर्माणमा सहयोग पुर्याउने लक्ष्यका साथ कालीगण्डकी सामुदायीक बिकास मञ्च (कदम) म्याग्दी नेपालको संघ संस्था ऐन २०३४ अनुसार जिल्ला प्रशासन कार्यालय म्याग्दीमा विधिवत रुपमा २०५६।०२।२७ मा दर्ता भई (द.नं. ११७&divide;०५६) समाज कल्याण परिषदमा २०६४।०५।०२ मा आवद्ध भएको (आ.नं.२३२२३) एउटा क्रियाशिल गैरसरकारी संस्था हो । यो एक गैरराजनैतिक, गैरसाम्प्रदायिक र मुनाफारहित मानव अधिकारमा आधारित&nbsp;सामाजिक तथा सेवामूलक संस्था हो ।</p>

                <p>&nbsp;</p>

                <p>आफ्नो स्थापनाकाल देखि हालसम्म आइपुग्दा म्याग्दी जिल्ला र छिमेकी जिल्लाका बिभिन्न समुदायहरुमा यस संस्थाले सामाजिक क्षेत्र (शिक्षा, स्वास्थ्य, खानेपानी, सरसफाइ), पूर्वाधार निर्माण (खानेपानी, शौचालय, स्वास्थ्यचौकी भवन) आर्थिक क्षेत्र (जिविकोपार्जन योजना निर्माण र कार्यान्वयन, घुम्तीकोष परिचालन, आर्यआर्जन क्रियाकलाप सञ्चालन, कृषि, पशुपालन, कृषि तथा वनमा आधारित एवम् गैरकाष्ठ बन पैदावारमा आधारित उद्यम विकास ), जलवायु तथा वातावरणीय क्षेत्र (वन व्यवस्थापन, मुहान संरक्षण, जलवायु अनुकुलन योजना निर्माण र कार्यान्वयन, स्वच्छ एवं नवीकरणीय उर्जा, सुधारिएको चुलो विस्तार एवम् प्रवर्धन) तथा मानव अधिकार संरक्षणको क्षेत्रमा सामाजिक परिचालनको प्रक्रियाबाट समूह निर्माण तथा व्यवस्थापन, विविध चेतनामुलक कार्यक्रमहरु, तालिम, गोष्ठीहरु, संचालन गरी व्यक्तिको व्यक्तित्व, नेतृत्व विकास संगै सामुदायिक विकासको गतिलाई उल्लेखनीय रुपमा अगाडि बढाउदै समृद्ध समाज निर्माणको आफ्नो सपनालाई पूरा गर्ने तर्फ निरन्तर लागिरहेको छ ।<br />
                <br />
                <strong>परिकल्पना&nbsp;&nbsp;:</strong>&nbsp; समुन्नत राष्ट्र<br />
                <br />
                <strong><strong>ध्येय :</strong></strong></p>

                <ul className='list-disc px-10'>
                    <li>सामुदायिक जन संगठनहरुको सुदृढिकरण, लैङ्गिक र सामाजिक विभेदको संवेदनशीलतामा सचेत नागरिक समाजलाई आधारभूत मानव अधिकारको सुनिश्चितता</li>
                    <li>श्रोत साधनको न्यायोचित परिचालन र वितरणको माध्यमबाट अधिकारवालाहरु आत्मनिर्भरतातर्फ उन्मुखता</li>
                    <li>सुशासन र आत्मअनुशासन प्रति अधिकारमुखी र उत्तरदायि नागरिक समाज</li>
                    <li>संस्थागत सुदृढीकरण तथा स्रोत संस्थाको रुपमा स्थापित</li>
                </ul>

                <p><strong>लक्ष्य :</strong></p>

                <ul className='list-disc px-10'>
                    <li>आर्थिक सवलीकरण सहित सामाजीक र साँस्कृतीक रुपान्तरणका माध्यमबाट मानव अधिकारको संरक्षण गर्दै समुन्नत राष्ट्रको निर्माण ।</li>
                    <li>अधिकारमुखी विकासको अवधारणाको अगुवाई गर्ने श्रोत सम्पन्न संस्थाको रुपमा संस्थालाई स्थापित गर्ने।</li>
                </ul>

                <p><strong><strong>उद्देश्य :</strong></strong></p>

                <ul className='list-disc px-10'>
                    <li>सामाजीक परिचालनः
                    <ul className='list-[square] px-5'>
                        <li>समुदायमा आधारित जनसंगठन तथा नागरिक समाजलाई मानव अधिकार सम्पन्न, सुशासनयुक्त तथा विभेदरहित समाज निर्माणतर्फ उन्मुख र&nbsp;सक्षम बनाउने&nbsp;।</li>
                        <li>सामाजिक विभेद समावेशीकरण र आधारभुत मानव अधिकारका बारेमा अधिकारवाला हरुलाई सचेत र संगठित बनाउने&nbsp;।</li>
                    </ul>
                    </li>
                    <li>गरिबी न्यूनिकरणः
                    <ul className='list-[square] px-5'>
                        <li>युवा शक्ति तथा पिछडिएको बर्ग र समुदायलाई परिचालन उनीहरुलाई सचेत बनाउदै कृषि, वन, प्रर्यटन, उद्यम बिकास आदिको माध्यमबाट सामाजीक आर्थिक बिकास तर्फ उन्मुख गराउदै राष्ट्रको बिकासतर्फ ध्यान आकर्षित गराउने&nbsp;।</li>
                        <li>पछाडि पारिएका महिला, दलित तथा विपन्न वर्गलाई क्षमता अनुसारको सीप विकास कार्यक्रम सञ्चालन गरी आयस्तरमा बृद्धि गर्ने ।</li>
                    </ul>
                    </li>
                    <li>समावेशी समाजः
                    <ul className='list-[square] px-5'>
                        <li>मानव अधिकार संरक्षणको बिषयमा भएका राष्ट्रिय तथा अन्तराष्टिय सन्धि सम्झौता आदिलाई टेवा पुर्याउन सचेतनामुलक प्रचारात्मक कार्यहरु सञ्चालन गर्ने ।</li>
                    </ul>
                    </li>
                    <li>महिला तथा बालबालिकाको अधिकारः
                    <ul className='list-[square] px-5'>
                        <li>महिला तथा बाल अधिकारको क्षेत्रमा कार्यहरु सञ्चालन गरी राष्ट्रिय तथा अन्तराष्टिय सन्धि सम्झौता आदिलाई टेवा पुर्याउन सचेतनामुलक प्रचारात्मक कार्यहरु सञ्चालन गर्ने&nbsp;।</li>
                    </ul>
                    </li>
                    <li>लक्षित बर्गः
                    <ul className='list-[square] px-5'>
                        <li>आयआर्जन मुलक कार्यक्रम, जनचेतनामुलक क्रियाकलाप तथा सिपमुलक कार्यहरु सञ्चालन गर्ने&nbsp;।</li>
                    </ul>
                    </li>
                    <li>जलवायुः
                    <ul className='list-[square] px-5'>
                        <li>जैविक विविधताको संरक्षणमा जोड दिई वातावरणीय सन्तुलन सम्बन्धी कार्यक्रमहरु सञ्चालन गर्ने&nbsp;।</li>
                    </ul>
                    </li>
                </ul>
            </div>
        </div>
    )
}

export default VMGOView